ms-python.autopep8
ms-python.mypy-type-checker
seaube.clangformat
mutantdino.resourcemonitor
ms-python.flake8
ms-python.black-formatter
augustocdias.tasks-shell-input
ms-python.pylint
tamasfe.even-better-toml
github.vscode-pull-request-github
nvidia.nsight-vscode-edition
github.copilot
ms-python.python
twxs.cmake
ms-python.vscode-pylance
llvm-vs-code-extensions.vscode-clangd
github.copilot-chat
ms-vscode.cpptools